[
    {
        "title": "Global Insurance Report 2025: The pursuit of growth",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/global-insurance-report",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Dr. Klaus-Peter Röhler",
        "role_title": "Insurance German Speaking Countries",
        "relevance_summary": "Dr. Röhler focuses on improving customer churn, cross-selling, and acquiring new customers, and the report discusses opportunities for insurers to innovate and expand coverage amidst challenges, which aligns directly with his interests.",
        "key_quotes": "The report identifies opportunities for capturing profitable growth as they navigate this shifting landscape. Amid these challenges, we see a chance for carriers to innovate, expand coverage, and increase the industry’s relevance."
    },
    {
        "title": "Context is key: Tanguy Catlin on advancing the future of insurance",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/context-is-key-tanguy-catlin-on-advancing-the-future-of-insurance",
        "company_name": "Allianz",
        "relevance_score": 85.0,
        "person_name": "Dr. Barbara Karuth-Zelle",
        "role_title": "COO",
        "relevance_summary": "The discussion on generative AI and its potential applications across the insurance industry aligns with Dr. Karuth-Zelle's interests in IT and innovation within insurance operations.",
        "key_quotes": "‘Gen AI changes the way you engage with your data... It’s about engagement and dialogue.’"
    },
    {
        "title": "Context is key: Tanguy Catlin on advancing the future of insurance",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/context-is-key-tanguy-catlin-on-advancing-the-future-of-insurance",
        "company_name": "Admiral",
        "relevance_score": 75.0,
        "person_name": "Mike Rogers",
        "role_title": "Chairman",
        "relevance_summary": "The article discusses the importance of generative AI in the insurance industry, which aligns with Mike's interest in evolving the motor insurance proposition and understanding new consumer service technologies.",
        "key_quotes": "The big topic this year is gen AI. Many of the insurtech companies here provide insurance carriers with gen AI to transform aspects of customer care in sales, claims, or underwriting. Gen AI changes the way you engage with your data."
    },
    {
        "title": "Scaling a niche start up into a necessary one: Insights from Arbol",
        "artefact_url": "https://www.mckinsey.com/capabilities/mckinsey-digital/our-insights/scaling-a-niche-start-up-into-a-necessary-one-insights-from-arbol",
        "company_name": "Allianz",
        "relevance_score": 90.0,
        "person_name": "Dr. Klaus-Peter Röhler",
        "role_title": "Insurance German Speaking Countries",
        "relevance_summary": "The article discusses parametric insurance solutions that fill coverage gaps, particularly relevant for addressing natural catastrophe risks. Given Dr. Röhler's focus on improving customer churn and cross-selling in the insurance industry, the innovative approach presented can be pivotal in enhancing Allianz’s offerings in property and casualty segments.",
        "key_quotes": "Parametric insurance supplements traditional insurance in situations, areas, and industries that are challenging to cover, thereby creating extra value."
    },
    {
        "title": "The six habits of highly successful chief risk officers",
        "artefact_url": "https://www.mckinsey.com/capabilities/risk-and-resilience/our-insights/the-six-habits-of-highly-successful-chief-risk-officers",
        "company_name": "Allianz",
        "relevance_score": 88.0,
        "person_name": "Claire-Marie Coste-Lepoutre",
        "role_title": "CFO",
        "relevance_summary": "The article discusses the changing role of Chief Risk Officers (CROs) and emphasizes the importance of risk management strategies that align with overall business goals. This is highly relevant for the CFO role, particularly in understanding profitability and integrating risk into financial strategies.",
        "key_quotes": "Successful CROs who engage in Habit 1—being explicit about their function’s purpose and vision—have already infused risk and resilience into the organization."
    },
    {
        "title": "Global Insurance Report 2025: Finding profitable personal lines growth",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/global-insurance-report-2025-finding-profitable-personal-lines-growth",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Dr. Klaus-Peter Röhler",
        "role_title": "Insurance German Speaking Countries",
        "relevance_summary": "The article discusses growth opportunities in the personal property and casualty insurance sector, which directly relates to improving customer churn and cross-selling, a key interest for Dr. Röhler.",
        "key_quotes": "The personal lines property and casualty (P&C;) industry writes about a quarter of the world’s insurance premiums... We believe these challenges represent a chance for carriers to innovate, expand coverage, and increase the industry’s relevance."
    },
    {
        "title": "The potential of gen AI in insurance: Six traits of frontrunners",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/the-potential-of-gen-ai-in-insurance-six-traits-of-frontrunners",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Dr. Barbara Karuth-Zelle",
        "role_title": "COO",
        "relevance_summary": "The article discusses the impact of generative AI on insurance operations, which aligns with Dr. Barbara's interests in IT and innovation in claims management. Enhanced efficiency in underwriting and claims processing through AI technologies is directly relevant to her role.",
        "key_quotes": "Generative AI is set to revolutionize business operations and enable new ways of creating and delivering insurance products."
    },
    {
        "title": "A live take from ITC Vegas 2024: Connecting the ideas, scaling up the innovation",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/a-live-take-from-itc-vegas-2024-connecting-the-ideas-scaling-up-the-innovation",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Dr. Barbara Karuth-Zelle",
        "role_title": "COO",
        "relevance_summary": "The article discusses the integration of innovation and technology in the insurance sector, which aligns with Dr. Karuth-Zelle's interests in IT and operational excellence. Insights on legacy systems and the necessity to adopt new technologies are particularly relevant for her role.",
        "key_quotes": "The tech challenge for the industry is twofold: how to put an end to the technology reaching obsolescence while simultaneously embracing a cutting edge future."
    },
    {
        "title": "How insurers can serve Asia’s aging population",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/how-insurers-can-serve-asias-aging-population",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Andreas Wimmer",
        "role_title": "Asset Management",
        "relevance_summary": "The article discusses innovative financial products targeting the aging population in Asia, which aligns with Wimmer's focus on integrated retirement solutions. It highlights issues of retirement savings shortfalls and the potential for insurers to offer suitable financial products to address these needs.",
        "key_quotes": "Insurers in particular are well placed to help ameliorate Asia’s pension gaps by offering products such as annuities. Strategies to help insurers address the retirement shortfall can include introducing innovative products, modifying the way products are sold to help educate customers..."
    },
    {
        "title": "Live take from ITC DIA Europe: For insurtechs, AI offers new opportunities for productivity growth and collaboration",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/live-take-from-itc-dia-europe-for-insurtechs-ai-offers-new-opportunities-for-productivity-growth-and-collaboration",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Dr. Barbara Karuth-Zelle",
        "role_title": "COO",
        "relevance_summary": "The article discusses collaboration between insurtechs and traditional insurers, which relates closely to Dr. Karuth-Zelle's focus on IT consolidation and the connected insurance platform. Additionally, the insights on AI-driven productivity improvements in operations align with her role in IT and operations.",
        "key_quotes": "The productivity promise of gen AI...new AI fueled transformations could have a productivity improvement potential as large as 30 to 40 percent."
    },
    {
        "title": "Four key themes from InsureTech Connect 2023",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/four-key-themes-from-insuretech-connect-2023",
        "company_name": "Admiral",
        "relevance_score": 75.0,
        "person_name": "Milena Mondini de Focatiis",
        "role_title": "CEO",
        "relevance_summary": "The article discusses profitability in the insurance sector and innovation through technology, particularly generative AI. This aligns with Milena's focus on car insurance premiums and trends in motor insurance innovation.",
        "key_quotes": "Enthusiasm about generative AI continues...insurance leaders see gen AI as a transformative opportunity for the industry in the long term."
    },
    {
        "title": "Can European insurtechs live up to the hype?",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/can-european-insurtechs-live-up-to-the-hype",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Sirma Boshnakova",
        "role_title": "Insurance Western and Southern Europe",
        "relevance_summary": "The article discusses the growing importance of insurtechs in driving digital transformation within the insurance industry, which aligns with her interests in associated companies and connected insurance platforms.",
        "key_quotes": "European insurtechs have the potential to become a €200 billion market by 2030. Insurtechs have long been viewed as a promising vehicle for driving widespread digital transformation in the insurance industry."
    },
    {
        "title": "McKinsey’s top insurance articles of 2022",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/mckinseys-top-insurance-articles-of-2022",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "C-Suite",
        "role_title": "All",
        "relevance_summary": "The article discusses claims inflation and profitability challenges which are critical issues for the C-Suite when making strategic decisions. Additionally, it touches on innovation within the insurance industry, aligning with their interests in driving customer relations and improving overall performance metrics.",
        "key_quotes": "What P&C insurers can do as claims inflation pressures results in Europe... Insurance is not typically considered a bastion of innovation."
    },
    {
        "title": "Opportunities for insurers in a rapidly shifting insurtech market",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/opportunities-for-insurers-in-a-rapidly-shifting-insurtech-market",
        "company_name": "Allianz",
        "relevance_score": 80.0,
        "person_name": "Dr. Barbara Karuth-Zelle",
        "role_title": "COO",
        "relevance_summary": "The insights on strategic actions for insurance carriers align with Dr. Karuth-Zelle's role in operations and IT. The need for evaluating technology improvements and addressing the capabilities of insurtechs is crucial for the company's IT advancements.",
        "key_quotes": "Now is the time to reevaluate those equations for both new and in flight initiatives."
    },
    {
        "title": "Five takeaways from InsureTech Connect 2022",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/five-takeaways-from-insuretech-connect-2022",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Sirma Boshnakova",
        "role_title": "Insurance Western and Southern Europe",
        "relevance_summary": "The article discusses the importance of technology-driven innovation and the digital transformation of the insurance industry, which aligns with Sirma's roles in Allianz Partners and insurance services.",
        "key_quotes": "The COVID 19 pandemic improved customers’ comfort with using digital channels, and now many insurance carriers have shifted significantly to become digitally enabled."
    },
    {
        "title": "Five takeaways from InsureTech Connect 2022",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/five-takeaways-from-insuretech-connect-2022",
        "company_name": "Admiral",
        "relevance_score": 75.0,
        "person_name": "Milena Mondini de Focatiis",
        "role_title": "CEO",
        "relevance_summary": "The article discusses technology-driven innovation and profitability in the insurance industry, which is crucial for optimizing car insurance premiums and adapting to trends.",
        "key_quotes": "Opportunity in the insurance industry remains strong, whether that means moving away from manual processes or using data in better ways."
    },
    {
        "title": "Are insurers ready for the future of mobility?",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/are-insurers-ready-for-the-future-of-mobility",
        "company_name": "Admiral",
        "relevance_score": 75.0,
        "person_name": "Mike Rogers",
        "role_title": "Chairman",
        "relevance_summary": "The article discusses the evolution of mobility and the implications for motor insurance, which aligns with Mike's interest in evolving propositions for market leadership in mobility.",
        "key_quotes": "The insurance industry must prepare itself for significant shifts in business priorities—the sooner the better."
    },
    {
        "title": "How the European assistance industry can sustain growth in the next normal",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/how-the-european-assistance-industry-can-sustain-growth-in-the-next-normal",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Sirma Boshnakova",
        "role_title": "Insurance Western and Southern Europe",
        "relevance_summary": "The article discusses growth opportunities in the assistance industry, relevant to Sirma's focus on associated companies and connected insurance platforms.",
        "key_quotes": "Leading assistance players have taken a number of actions to drive operational efficiencies... Companies will need to forge innovative digital partnerships."
    },
    {
        "title": "How insurtechs can accelerate the next wave of growth",
        "artefact_url": "https://www.mckinsey.com/industries/financial-services/our-insights/insurance-blog/how-insurtechs-can-accelerate-the-next-wave-of-growth",
        "company_name": "Allianz",
        "relevance_score": 75.0,
        "person_name": "Sirma Boshnakova",
        "role_title": "Insurance Western and Southern Europe",
        "relevance_summary": "The article discusses insurtechs and their role in transforming the insurance industry, which relates to Allianz Partners and the connected insurance platform.",
        "key_quotes": "Tech driven innovation is fundamentally reshaping the insurance industry."
    }
]